<img src="../Img/Python_SQL_PI.png" style="width:100%">


<p style="font-size:22px;text-align:center">Лекция 4. Подзапросы</p> 

<a id = Home></a>

24 марта 2022 года, чт<br>
ПИ20-1, ПИ20-2, ПИ20-3, <br>

28 марта 2022 года, пн<br>
ПИ20-4, ПИ20-5, ПИ20-6

<p style="font-size:16px;">Вопросы

4.1. [Вложенные подзапросы](#1)<br>
4.2. [Связанные подзапросы](#2)<br>
4.3. [Связанные подзапросы в HAVING](#3)<br>
4.4. [Оператор EXISTS](#4)<br>
4.5. [Операторы сравнений с множеством значений IN, ANY, ALL](#5)<br>
4.6. [Особенности применения операторов ANY, ALL, EXISTS при обработке отсутствующих данных](#6)<br>
4.7. [Использование COUNT вместо EXISTS](#7)<br>
4.8. [Выполнение запросов с помощью SQLAlchemy](#8)


```
STUDENT
STUDENT_ID — числовой код, идентифицирующий студента (идентификатор студента),
SURNAME — фамилия студента,
NAME — имя студента,
STIPEND — стипендия, которую получает студент,
KURS — курс, на котором учится студент,
CITY — город, в котором живет студент,
BIRTHDAY — дата рождения студента,
UNIV_ID — идентификатор университета, в котором учится студент.

LECTURER
LECTURER_ID — идентификатор преподавателя,
SURNAME — фамилия преподавателя,
NAME — имя преподавателя,
CITY — город, в котором живет преподаватель,
UNIV_ID — идентификатор университета, в котором работает преподаватель

SUBJECT
SUBJ_ID — идентификатор предмета обучения,
SUBJ_NAME — наименование предмета обучения,
HOUR — количество часов, отводимых на изучение предмета,
SEMESTER — семестр, в котором изучается данный предмет.

UNIVERSITY
UNIV_ID — идентификатор университета,
UNIV_NAME — название университета,
RATING — рейтинг университета,
CITY — город, в котором расположен университет.

EXAM_MARKS
EXAM_ID — идентификатор экзамена,
STUDENT_ID — идентификатор студента,
SUBJ_ID — идентификатор предмета обучения,
MARK — экзаменационная оценка,
EXAM_DATE — дата экзамена.

SUBJ_LECT
LECTURER_ID — идентификатор преподавателя,
SUBJ_ID — идентификатор предмета обучения.
```

<img src="../Img/Students_Schema.png" style="width:79%">

<a id=1></a>[К оглавлению](#Home)

## 4.1. Вложенные подзапросы

### 4.1.1. Подзапросы с единственным значением

SQL позволяет использовать одни запросы внутри других запросов, т. е. вкладывать запросы друг в друга. Предположим, известна фамилия студента (Васильев), но неизвестно значение поля STUDENT_ID для него. Чтобы извлечь данные обо всех оценках этого студента, можно записать следующий запрос:

```
SELECT *
    FROM exam_marks
    WHERE student_id =
        (SELECT student_id
         FROM student WHERE surname = 'Васильев');

exam_id  student_id  subj_id  mark  exam_date
-------  ----------  -------  ----  --------------------------
19       128         73       3     2021-06-02 00:00:00.000000
27       128         13       5     2020-09-21 00:00:00.000000
```
Отметим, что этот запрос корректен только в том случае, если в результате выполнения указанного в скобках подзапроса
возвращается единственное значение. Если в результате выполнения подзапроса будет возвращено несколько значений, то при выполнении запроса будет зафиксирована ошибка. В данном примере это произойдет, если в таблице STUDENT будет несколько записей со значениями поля 
```
surname = 'Васильев'
```

В некоторых случаях для гарантии получения единственного значения в результате выполнения подзапроса используется DISTINCT.
Одним из видов функций, которые автоматически всегда выдают в результате единственное значение для любого количества строк, являются агрегирующие функции.

### 4.1.2. Оператор IN

Оператор IN также широко применяется в подзапросах. Он задает список значений, с которыми сравниваются другие значения для определения истинности задаваемого этим оператором предиката. Данные обо всех оценках (таблица EXAM_MARKS) студентов из
Воронежа можно выбрать с помощью следующего запроса:
```
SELECT exam_id, student_id, subj_id, mark, date(exam_date)
    FROM exam_marks
    WHERE student_id IN (
        SELECT student_id FROM student WHERE city='Воронеж');

exam_id  student_id  subj_id  mark  date(exam_date)
-------  ----------  -------  ----  ---------------
75       55          10       5     2000-01-23
101      654         11       4     2019-05-30
639      55          10             2019-05-29
```

### 4.1.3. Вложенные подзапросы в HAVING

Подзапросы можно применять внутри предложения HAVING. Пусть требуется определить количество предметов обучения с оценкой, превышающей среднее значение оценки студента с идентификатором 12:

```
SELECT COUNT(DISTINCT subj_id), mark
    FROM exam_marks
    GROUP BY mark
    HAVING mark
    >
        (SELECT AVG(mark)
         FROM exam_marks
         WHERE student_id = 12);

COUNT(DISTINCT subj_id)  mark
-----------------------  ----
6                        4
6                        5
```

<a id=2></a>[К оглавлению](#Home)

## 4.2. Связанные подзапросы

При использовании подзапросов во внутреннем запросе можно ссылаться на таблицу, имя которой указано в предложении FROM внешнего запроса. Такие подзапросы называются связанными.

Связанный подзапрос выполняется по одному разу для каждой строки таблицы основного запроса, а именно:

- выбирается строка из таблицы, имя которой указано во внешнем запросе;
- выполняется подзапрос, и полученное в результате его выполнения значение применяется для анализа этой строки в условии предложения WHERE внешнего запроса;
- по результату оценки этого условия принимается решение о включении или невключении строки в состав выходных данных;
- процедура повторяется для следующей строки таблицы внешнего запроса.

<u>Пример.</u>
Выбрать сведения обо всех предметах обучения, по которым проводился экзамен 26 мая 2020 г.

```
SELECT * FROM subject
    WHERE subj_id = (
        SELECT subj_id FROM exam_marks  
        WHERE DATE(exam_date)='2020-05-26' AND subject.subj_id=exam_marks.subj_id);

subj_id  subj_name        hour  semester
-------  ---------------  ----  --------
10       Информатика      56    1
12       Анализ данных    42    1
56       История          34    4
94       Английский язык  56    3
```

Этот же результат можно получить с помощью связанного подзапроса в сочетании с оператором IN.

```
SELECT * FROM subject s
    WHERE '2020-05-26' IN (
        SELECT DATE(em.exam_date) FROM exam_marks em
        WHERE s.subj_id=em.subj_id);
```

В приведенном запросе *s* и *em* являются псевдонимами (алиасами), т. е. специально вводимыми именами, которые могут быть использованы в данном запросе вместо настоящих имен. В приведенном примере они используются вместо имен таблиц *subject* и *exam_marks*.

Можно использовать подзапросы, связывающие таблицу со своей собственной копией. Например, надо найти идентификаторы, фамилии
и стипендии студентов, получающих стипендию выше средней на курсе, на котором они учатся:

```
SELECT s.student_id, s.surname, s.stipend
    FROM student s
    WHERE stipend > (
        SELECT AVG(s2.stipend) FROM student s2 where s.kurs=s2.kurs); 
```

<a id=3></a>[К оглавлению](#Home)

## 4.3. Связанные подзапросы в HAVING

Ранее (в предыдущей теме) указывалось, что предложение GROUP BY позволяет группировать выводимые SELECT-запросом записи по значению некоторого поля. Использование предложения HAVING позволяет при выводе осуществлять фильтрацию таких групп. Предикат предложения HAVING оценивается не для каждой строки результата, а для каждой группы выходных записей, сформированной предложением GROUP BY
внешнего запроса.

Пусть, например, необходимо по данным из таблицы EXAM_MARKS определить сумму полученных студентами оценок (значений поля MARK), сгруппировав значения оценок по датам экзаменов и исключив те дни, когда число студентов, сдававших в течение дня экзамены, было больше трёх.

```
SELECT date(exam_date), sum(mark)
    FROM exam_marks e1
    GROUP BY date(exam_date)
    HAVING 3 < (
        SELECT count(e2.student_id) FROM exam_marks e2
        WHERE date(e1.exam_date)=date(e2.exam_date)
        );

date(exam_date)  sum(mark)
---------------  ---------
2019-05-29       24
2020-05-26       18
2021-06-02       12
```

<a id=4></a>

[К оглавлению](#Home)

## 4.4. Использование оператора EXISTS

Используемое в SQL ключевое слово EXISTS (СУЩЕСТВУЕТ) представляет собой предикат, принимающий значение истина или ложь.
Используя подзапросы в качестве аргумента, этот оператор оценивает результат выполнения подзапроса как истинный, если этот подзапрос генерирует выходные данные, то есть в случае существования (возврата) хотя бы одного найденного значения. В противном случае результат подзапроса — ложный. Оператор EXISTS не может принимать значение неизвестно).

Пусть, например, нужно извлечь из таблицы EXAM_MARKS данные о студентах, получивших хотя бы одну неудовлетворительную оценку:
```
SELECT DISTINCT student_id
    FROM exam_marks A
    WHERE EXISTS
        (SELECT distinct student_id
        FROM exam_marks B
        WHERE B.mark < 3
        AND B.student_id=A.student_id);
```
При использовании связанных подзапросов предложение EXISTS анализирует каждую строку таблицы, на которую имеется ссылка во
внешнем запросе. Главный запрос получает строки-кандидаты на проверку условия. Для каждой строки-кандидата выполняется подзапрос. Как только при выполнении подзапроса находится строка, в которой значение в столбце MARK удовлетворяет условию, его выполнение прекращается и возвращается значение истина внешнему запросу, который затем анализирует свою строку-кандидата.

<u>Пример.</u> 

Получить идентификаторы предметов обучения, экзамены по которым сдавались не одним, а несколькими студентами.
```
SELECT group_concat(DISTINCT em1.subj_id)
    FROM exam_marks em1
    WHERE EXISTS (
        SELECT *
        FROM exam_marks em2
        WHERE em1.subj_id = em2.subj_id AND em1.student_id <> em2.student_id
        );

10,73,56,12,22,13,94,43,11

```

Часто EXISTS применяется с оператором NOT (по-русски NOT EXISTS интерпретируется, как “не существует...”). Если предыдущий запрос сформулировать следующим образом: “Найти идентификаторы предметов обучения, которые сдавались одним и только одним студентом (другими словами, для которых не существует другого сдававшего студента),” то достаточно просто поставить NOT перед
EXISTS.

Возможности применения вложенных запросов весьма разнообразны. Например, пусть из таблицы STUDENT требуется извлечь строки
для каждого студента, сдавшего более одного предмета:

```
SELECT surname, name FROM student s
WHERE EXISTS (
    SELECT student_id, count(subj_id) FROM exam_marks em
    WHERE s.student_id = em.student_id
    GROUP BY student_id
    HAVING count(subj_id) > 1
    );
```

<a href=#Home>К оглавлению</a>

<a id = 5></a>

## 4.5. Операторы сравнений с множеством значений IN, ANY, ALL

Операторы сравнения с множеством значений имеют следующий смысл.

<TABLE>
    <TR><TD style="text-align:left"><b>IN</b></TD><TD style="text-align:left"> Равно хотя бы одному из значений, полученных во внутреннем запросе.</TD></TR>
    <TR><TD style="text-align:left"><b>NOT IN</b></TD><TD style="text-align:left"> Не равно ни одному из значений, полученных во внутреннем запросе.</TD></TR>
    <TR><TD style="text-align:left"><b>=ANY</b></TD><TD style="text-align:left"> То же, что и <b>IN</b>. Соответствует логическому оператору <b>OR</b>.</TD></TR>
    <TR><TD style="text-align:left"><b> &gt;ANY, &gt;=ANY</b></TD> <TD style="text-align:left">Больше (либо больше или равно) хотя бы одного из полученных значений. Эквивалентно > (или >=) для наименьшего из полученных значений.</TD></TR>
    <TR><TD style="text-align:left"><b>=ALL</b></TD> <TD style="text-align:left">Равно каждому из полученных значений. Эквивалентно логическому оператору <b>AND</b>.</TD></TR>
    <TR><TD style="text-align:left"><b>&gt;ALL, &gt;=ALL</b></TD> <TD style="text-align:left">Больше (либо больше или равно) каждого из полученных значений. Эквивалент &gt; (или &gt;=) для наибольшего из полученных значений.</TD></TR>
    <TR><TD style="text-align:left"><b>&lt;ALL, &lt;=ALL</b></TD> <TD style="text-align:left">Меньше (либо меньше или равно) каждого из полученных значений. Эквивалентно &lt; (или &lt;=) наименьшего из полученных значений.</TD></TR>
</TABLE>

<u>Пример</u>

Выбрать сведения о студентах, обучающихся в университетах, расположенных в городах их проживания.

```
SELECT *
FROM student s
WHERE city = ANY (
    SELECT city
    FROM university u
    WHERE s.univ_id = u.univ_id);
```

Реализация в СУБД PostgreSQL.

```
Students=# SELECT student_id, surname, name,
Students-# stipend, kurs, city, date(birthday), univ_id
Students-# FROM student s
Students-# WHERE city = ANY
Students-# (SELECT city FROM university u
Students(# WHERE u.univ_id = s.univ_id);
 student_id |  surname  |   name    | stipend | kurs |    city     |    date    | univ_id
------------+-----------+-----------+---------+------+-------------+------------+---------
          6 | Сидоров   | Вадим     |     150 |    4 | Москва      | 1999-06-07 |      22
         32 | Котов     | Павел     |     150 |    5 | Белгород    | 2001-02-28 |      14
         55 | Белкин    | Вадим     |     250 |    5 | Воронеж     | 2000-01-07 |      10
         58 | Журавлева | Вера      |       0 |    4 | Новосибирск | 2003-06-14 |      11
        200 | Баранов   | Александр |     220 |    2 | Москва      | 2001-08-18 |      44
        203 | Петрова   | Екатерина |     250 |    4 | Белгород    | 2001-05-21 |      14
        207 | Миронова  | Федор     |     200 |    3 | Москва      | 2002-04-15 |      45
        265 | Павлов    | Андрей    |       0 |    3 | Воронеж     | 2000-11-05 |      10
        654 | Лукин     | Артем     |     200 |    3 | Воронеж     | 2001-12-01 |      10
(9 строк)
```

<u>Пример</u>

Выборка данных об идентификаторах студентов, у которых оценки превосходят величину по крайней мере одной из оценок, полученных
26 мая 2020 года.:

```
SELECT DISTINCT student_id
FROM exam_marks
WHERE mark > ANY (
    SELECT mark FROM exam_marks 
    WHERE date(exam_date) = '2020-05-26');
```

Реализация в СУБД PostgreSQL.

```
Students=# SELECT DISTINCT student_id
Students-# FROM exam_marks
Students-# WHERE mark > ANY (
Students(# SELECT mark FROM exam_marks
Students(# WHERE date(exam_date) = '2020-05-26') LIMIT 5;
 student_id
------------
         71
         92
        101
        149
        103
(5 строк)
```

Оператор **ALL**, как правило, эффективно используется с неравенствами, а не с равенствами, поскольку значение равно всем, которое должно получиться в этом случае в результате выполнения подзапроса, может иметь место, только если все результаты идентичны. Такая ситуация практически не может быть реализована, так как если подзапрос генерирует множество различных значений, то никакое отдельное значение не может быть равно сразу всем значениям в обычном смысле. В SQL выражение **<>ALL** реально означает не равно ни одному из результатов подзапроса.

<u>Пример</u>

Подзапрос, выбирающий данные о названиях всех университетов с рейтингом более высоким, чем рейтинг любого университета в Воронеже:

```
SELECT *
FROM university
WHERE rating > ALL
(SELECT rating FROM university
WHERE city = 'Воронеж');
```

Реализация в СУБД PostgreSQL.

```
Students=# SELECT *
Students-# FROM university
Students-# WHERE rating > ALL
Students-# (SELECT rating FROM university
Students(# WHERE city = 'Воронеж');
 univ_id |    univ_name     | rating |    city
---------+------------------+--------+-------------
      11 | НГУ              |    345 | Новосибирск
      12 | МФТИ             |    500 | Москва
      15 | ТГУ              |    368 | Томск
      22 | МГУ              |    606 | Москва
      32 | РГУ              |    416 | Ростов
      44 | ФинУ             |    330 | Москва
      45 | МГТУ им. Баумана |    372 | Москва
      47 | КФУ              |    330 | Казань
(8 строк)
```

<u>Пример</u>

В предыдущем примере вместо **ALL** можно также использовать **ANY** (проанализируйте, как в этом случае изменится смысл приведенного запроса):

```
SELECT *
FROM university
WHERE NOT rating > ANY
(SELECT rating
FROM university
WHERE city = 'Воронеж');
```

Реализация в СУБД PostgreSQL.

```
Students=# SELECT *
Students-# FROM university
Students-# WHERE NOT rating > ANY
Students-# (SELECT rating
Students(# FROM university
Students(# WHERE city = 'Воронеж');
 univ_id | univ_name | rating |   city
---------+-----------+--------+-----------
      10 | ВГУ       |    296 | Воронеж
      48 | УЛГУ      |    231 | Ульяновск
(2 строки)
```

<a href=#Home>К оглавлению</a>

<a id = 6></a>

## 4.6. Особенности применения операторов ANY, ALL, EXISTS при обработке отсутствующих данных

Необходимо иметь в виду, что операторы ANY и ALL по-разному реагируют на ситуацию, когда правильный подзапрос не генерирует
никаких выходных данных. В этом случае оператор ALL автоматически принимает значение истина, а оператор ANY — значение ложь.
В случае, когда в базе отсутствуют данные об университетах из города Саратова, запрос
```
SELECT *
FROM university
WHERE rating > ANY
    (SELECT rating
    FROM university
    WHERE city = 'Саратов');
```

не генерирует никаких выходных данных.

```
 univ_id | univ_name | rating | city
---------+-----------+--------+------
(0 строк)
```

В такой же ситуации запрос

```
SELECT *
FROM UNIVERSITY
WHERE RATING > ALL
    (SELECT RATING
    FROM UNIVERSITY
    WHERE CITY = 'Ухань');
```

полностью воспроизведет таблицу *university*.

Использование NULL-значений также создает определенные проблемы для рассматриваемых операторов. Пусть имеются один или несколько университетов Томске с определенным рейтингом.

```
Students=# SELECT * FROM university WHERE city = 'Томск';
 univ_id | univ_name | rating | city
---------+-----------+--------+-------
      15 | ТГУ       |    368 | Томск
(1 строка)
```

Рассмотрим в качестве примера две реализации запроса “Найти все данные об университетах, рейтинг которых меньше рейтинга любого университета в Томске”.

1)
```
SELECT *
FROM university
WHERE rating < ANY
    (SELECT rating
    FROM university
    WHERE city = 'Томск');
```

2)
```
SELECT *
FROM university A
WHERE NOT EXISTS
	(SELECT *
	FROM university B
	WHERE A.rating >= B.rating
	AND B.city = 'Томск');
```

При отсутствии в таблице NULL-значений оба эти запроса ведут себя совершенно одинаково.

<img src="../Img/l4_6_a.png" style="width:60%">

Пусть теперь в таблице UNIVERSITY есть строка с NULL-значениями в столбце RATING. В версии запроса c ANY в основном запросе,
когда выбирается поле RATING с NULL, предикат принимает значение *неизвестно* и строка, так же как и в случае, когда результатом сравнения будет ложь, не включается в состав выходных данных. Во втором же варианте запроса, когда в основном запросе выбирается строка с NULL в поле RATING, предикат, используемый в подзапросе, примет значение неизвестно. Поэтому при выполнении подзапроса не будет получено ни одной строки, в результате чего оператор NOT EXISTS примет значение *истина*, и, следовательно, данная строка с NULL-значением попадет в выходные данные основного запроса.

<img src="../Img/l4_6_b.png" style="width:60%">

По смыслу этого запроса такой результат не является правильным, так как на самом деле рейтинг университета, описываемого данной
строкой, может быть и больше рейтинга какого-либо томского университета (он просто неизвестен). Указанная проблема связана с тем, что значение EXISTS всегда принимает значения истина или ложь, и никогда — неизвестно. Это является доводом для использования в данном случае оператора ANY вместо NOT EXISTS.

<a href=#Home>К оглавлению</a>

<a id = 7></a>

## 4.7. Использование COUNT вместо EXISTS

При отсутствии NULL-значений оператор EXISTS может быть использован вместо ANY и ALL. Также вместо EXISTS и NOT EXISTS
могут быть использованы те же самые подзапросы, но с использованием `COUNT(*)` в предложении SELECT. Например, запрос

```
SELECT *
FROM university A
WHERE NOT EXISTS
    (SELECT *
    FROM university B
    WHERE A.rating >= B.rating
    AND B.city = 'Москва');
```

может быть представлен и в следующем виде.

```
SELECT *
FROM university A
WHERE 1 >
    (SELECT COUNT(*)
    FROM university B
    WHERE A.rating >= B.rating
    AND B.city = 'Москва');
```

Результат этих запросов одинаковый.

```
 univ_id |    univ_name    | rating |      city
---------+-----------------+--------+-----------------
      10 | ВГУ             |    296 | Воронеж
      14 | БГУ             |    326 | Белгород
      18 | ВГМА            |    327 | Воронеж
      46 | ФГБОУ "Политех" |    300 | Санкт-Петербург
      47 | КФУ             |        | Казань
      48 | УЛГУ            |    231 | Ульяновск
(6 строк)
```

<a href=#Home>К оглавлению</a>

<a id = 8></a>


# 4.8. Выполнение запросов с помощью SQLAlchemy

In [15]:
from sqlalchemy import MetaData, Table, create_engine, select, and_, or_, not_
from sqlalchemy.sql import func, exists

In [2]:
# conda install psycopg2

Для подключения к СУБД PostgreSQL используется следующий синтаксис
```
engine = create_engine('postgresql[+DBAPI]://username:password@localhost:Port/Students')
```
Например, если сервер СУБД PostgreSQL установлен на локальный компьютер:

In [3]:
#engine = create_engine('postgresql+psycopg2://postgres:abc^Y#234@localhost:5432/Students')

Для подключения к СУБД SQLite3 используем следующую строку

In [4]:
engine = create_engine('sqlite+pysqlite:///../Data/Students.db')
conn = engine.connect()

In [5]:
metadata = MetaData() # Объект-контейнер, содержит информацию о схеме данных
metadata.reflect(bind=engine) # Отображение БД

In [6]:
# Таблицы в БД
metadata.tables.keys()

dict_keys(['city', 'exam_marks', 'student', 'university', 'subject', 'lecturer', 'subj_lect'])

In [7]:
exam_marks=Table("exam_marks", metadata, autoload=True, autoload_with="engine")
lecturer=Table("lecturer", metadata, autoload=True, autoload_with="engine")
student=Table("student", metadata, autoload=True, autoload_with="engine")
subj_lect=Table("subj_lect", metadata, autoload=True, autoload_with="engine")
subject=Table("subject", metadata, autoload=True, autoload_with="engine")
university=Table("university", metadata, autolad=True, autolad_with="engine")

<img src=../Img/pencil.png style="width:190px;height:190px">
<p style="background-color:powderblue; font-size:125%; color: rebeccapurple;">Выполните задания</p>
<p>Выполните задания c помощью Jupyter Notebook и языка програмирования Python</p>

In [13]:
# Извлечь данные об оценках сутента Васильева.

subq = select(student.c.student_id)
subq = subq.where(student.c.surname=='Васильев').scalar_subquery()

s = select(exam_marks.c.mark)
s = s.where(exam_marks.c.student_id==subq)

result = conn.execute(s).fetchall()
result

[(3,), (5,)]

In [40]:
# Найти студентов, у которых только отличные оценки.

# Студенты, сдававшие экзамен
subq1 = exists().where(and_(exam_marks.c.mark != None, exam_marks.c.student_id == student.c.student_id))

# Студенты, не имеющие оценок, кроме отличных
subq2 = ~exists().where(and_(exam_marks.c.mark < 5, exam_marks.c.student_id == student.c.student_id))

s = select(student.c.student_id, student.c.name, student.c.surname)
s = s.where(subq1).where(subq2)

print(s, s.compile().params)

result = conn.execute(s).fetchall()
result

SELECT student.student_id, student.name, student.surname
FROM student
WHERE (EXISTS (SELECT *
FROM exam_marks
WHERE exam_marks.mark IS NOT NULL AND exam_marks.student_id = student.student_id)) AND NOT (EXISTS (SELECT *
FROM exam_marks
WHERE exam_marks.mark < :mark_1 AND exam_marks.student_id = student.student_id)) {'mark_1': 5}

[(10, 'Борис', 'Кузнецов'),
 (55, 'Вадим', 'Белкин'),
 (82, 'Элеонора', 'Лапина'),
 (88, 'Ирина', 'Жданова'),
 (91, 'Ираида', 'Блохина'),
 (92, 'Светлана', 'Мельникова'),
 (99, 'Марина', 'Борисова')]